tap "homebrew/cask-fonts"

# Core stuff
brew "ag"
brew "fish"
brew "mas"
brew "git"
brew "curl"
brew "wget"
brew "zsh"
brew "nvm"
brew "neovim"
brew "python3"
brew "watchman"
brew "gpg"
brew "pinentry"
brew "autojump"
brew "hugo"
brew "go"
brew "archey"
brew "htop"
brew "tree"
brew "ncdu"
brew "tldr"
brew "thefuck"
brew "jq"


# Cask homebrew 
cask "alfred"
cask "telegram"
cask "google-chrome"
cask "firefox"
cask "figma"
cask "spotify"
cask "iterm2"
cask "visual-studio-code"
cask "slack"
cask "the-unarchiver"
#cask "insomnia"
#cask "openemu"
cask "google-cloud-sdk"
cask "sequel-pro"
cask "numi"
cask "skype"
cask "cyberduck"
cask "hazel"
cask "vlc"
cask "dropbox"
cask "tomighty"
cask "omnifocus"
cask "docker"
cask "microsoft-office"
cask "paparazzi"
cask "java" unless system "/usr/libexec/java_home --failfast"
cask "font-ibm-plex"
cask "grandperspective"

mas "1Password 7", id: 1333542190
mas "BetterSnapTool", id: 417375580
mas "Bear", id: 1091189122
