tap "caskroom/cask"
tap "neovim/neovim"
tap "homebrew/homebrew-php"

# Core stuff
brew "git"
brew "curl"
brew "wget"
brew "zsh"
brew "nvm"
brew "neovim"
brew "python3"
brew "php-version"
brew "php71"
brew "composer"


# Cask homebrew 
cask "alfred"
cask "telegram"
cask "google-chrome"
cask "sketch"
cask "spotify"
cask "iterm2"
cask "virtualbox"
cask "vagrant"
cask "visual-studio-code"
cask "anki"
cask "cleanmymac"
cask "slack"
cask "insomnia"
cask "the-unarchiver"
cask "litecoin"
cask "electrum-ltc"

mas "BetterSnapTool", id: 417375580
mas "GIPHY CAPTURE", id: 668208984
mas "Annotate - Capture and Share", id: 918207447 
mas "Frank DeLoupe", id: 530458789 
mas "Shush - Microphone Manager", id: 496437906 

