tap "caskroom/cask"
tap "neovim/neovim"
tap "homebrew/homebrew-php"
tap "caskroom/versions"

# Core stuff
brew "mas"
brew "git"
brew "curl"
brew "wget"
brew "zsh"
brew "nvm"
brew "neovim"
brew "python3"
brew "php-version"
brew "php71"
brew "composer"
brew "watchman"
brew "gpg"
brew "pinentry"
brew "autojump"
brew "hugo"
brew "go"
brew "jq"

# Cask homebrew 
cask "alfred"
cask "telegram"
cask "google-chrome"
cask "firefox"
cask "sketch"
cask "spotify"
cask "iterm2"
cask "vagrant"
cask "visual-studio-code"
cask "anki"
cask "cleanmymac"
cask "slack"
cask "insomnia"
cask "the-unarchiver"
cask "electrum-ltc"
cask "tunnelblick"
cask "insomnia"
cask "openemu"
cask "google-cloud-sdk"
cask "sequel-pro"
cask "numi"
cask "skype"
cask "cyberduck"
cask "hazel"
cask "hammerspoon"
cask "vlc"
cask "dropbox"
cask "typora"
cask "wireshark"
cask "etcher"
cask "bartender"
cask "tomighty"
cask "omnifocus"
cask "docker"
cask "insomnia"
cask "transmission"
cask "hazel"

mas "1Password 7", id: 1333542190
mas "BetterSnapTool", id: 417375580
mas "Bear", id: 1091189122
mas "Annotate - Capture and Share", id: 918207447 
mas "Frank DeLoupe", id: 530458789 
mas "Shush - Microphone Manager", id: 496437906 
mas "Pixen", id: 525180431
mas 'SimpleMind Free', id: 439654198

